Revit 2026 API

# BuiltInFailuresSculptingFailuresFaceSculptEditFailed Property

---

Face Sculpt Edit failed.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FailureDefinitionId FaceSculptEditFailed { get; }
```
```vb
Public Shared ReadOnly Property FaceSculptEditFailed As FailureDefinitionId
	Get
```
```cpp
public:
static property FailureDefinitionId^ FaceSculptEditFailed {
	FailureDefinitionId^ get ();
}
```
```fsharp
static member FaceSculptEditFailed : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId

#### Reference

BuiltInFailuresSculptingFailures Class

Autodesk.Revit.DB Namespace